Commands over Bluetooth.
Version 0.1.


Errorcodes:
    0 - no errors
    1 - unknown command
    2 - command timeout (slave node did not respond)
    3 - slave node with given address doesn't exist


Command:
    AT+WATER=<address>,<state>
Description:
    Turns off or on the water switch.
Answer:
    OK or
    ERROR <errcode>
Params:
    <address> - address of the slave node, dec format
    <state> - 0 for off, 1 for on



Command:
    AT+WATER?<address>
Description:
    Returns state of water switch on node with address <address>.
Answer:
    +WATER=<address>,<state> or
    ERROR <errcode>
Params:
    <address> - address of the slave node, dec format
    <state> - 0 for off, 1 for on



Command:
    AT+PING?<address>
Description:
    Ping the node with address <address>.
Answer:
    +PONG=<address> or
    ERROR <errcode>
Params:
    <address> - address of the slave node, dec format



Command:
    AT+PING*
Description:
    Ping and list all slave nodes. Each node responces with pong, and each answer places on one line. The number of lines equals to number of active nodes. Each line appears with some delay, and the entire time could be relatively long (a second and more, depending on node configuration).
Answer:
    +PONG=<address_1>
    +PONG=<address_2>
    ...
Params:
    <address_x> - address of the slave node, dec format
